package yandex.java.tree_height.java;

/*
Реализуйте бинарное дерево поиска для целых чисел.

Элементы добавляются в дерево последовательно, балансировки не происходит
(первый элемент последовательности будет являться корнем дерева).

Найдите высоту получившегося дерева.

Формат ввода:
На вход программа получает последовательность натуральных чисел.
Последовательность завершается числом 0, которое означает конец ввода.
Добавлять его в дерево не надо.

Формат вывода:
Выведите высоту получившегося дерева.

Примечание:
Бинарное дерево поиска — дерево, обладающее следующим свойствами:
- У каждой вершины не более двух детей.
- Все вершины обладают ключами, на которых определена операция сравнения
(в данной задаче ключами являются целые числа).
- У всех вершин левого поддерева вершины v ключи не больше, чем ключ v.
- У всех вершин правого поддерева вершины v ключи больше, чем ключ v.
- Оба поддерева — левое и правое — являются двоичными деревьями поиска.

Для тестового примера, бинарное дерево поиска будет иметь следующий вид:
<p><img src="content/binary_search_tree.jpg"/></p>
*/


public class Main {
}
